print('«Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .»')
print('Введите недостающее слово («покрытая …») ')
a = input()
print('Введите недостающую букву («кожиц..й») ')
b = input()
print('Введите недостающее слово («держится на … ») ')
c = input()
print('Введите недостающую букву («ножк..») ')
d = input()
print('Введите недостающее слово («затянута … ») ')
e = input()
print('Введите недостающее слово («нижняя … ») ')
f = input()
print('Введите недостающую букву («шляпк..») ')
g = input()q


print(f'«Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g} .»')